sample_data/test_files_synthetic/small/soap/soap12_envelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:wsa="http://www.w3.org/2005/08/addressing"
               xmlns:user="http://example.com/userservice">
  <soap:Header>
    <wsa:To>http://example.com/userservice</wsa:To>
    <wsa:Action>http://example.com/userservice/GetUser</wsa:Action>
    <wsa:MessageID>urn:uuid:87654321-4321-4321-4321-210987654321</wsa:MessageID>
    <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>admin</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">admin123</Password>
      </UsernameToken>
    </Security>
  </soap:Header>
  <soap:Body>
    <user:GetUser>
      <user:UserId>12345</user:UserId>
      <user:IncludeProfile>true</user:IncludeProfile>
    </user:GetUser>
  </soap:Body>
</soap:Envelope>